/******************************************************************************/
/*******************************************************************************
  文件名：图像采集程序IamgeGet.c
  功  能：图像采集
  日  期：2014.10.09
  作  者：HJZ
  备  注：

*******************************************************************************/
/******************************************************************************/

#include "ImageGet.h"

uint16 LineCount;          //当前采集的行的计数值
uint16 LineRealCount;      //当前实际的行的计数值
//uint8 LineCount_Index;
/*
uint8 const LineRealCountVal01[CameraHight] = //当前实际的行的初始值，隔3行取1行
{
3,6,9,12,15,18,21,24,27,30,33,36,39,42,45,48,51,54,57,60,63,66,69,72,75,78,81,
84,87,90,93,96,99,102,105,108,111,114,117,120,123,126,129,132,135,138,141,144,
147,150,153,156,159,162,165,168,171,174,177,180,183,186,189,192,195,198,201,
204,207,210,213,216,219,222,225,228,231,234,237,238
};
uint8 const LineRealCountVal02[CameraHight] = //当前实际的行的初始值，连续取中间的80行，效果不如隔行取好
{
151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,
171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,
191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,
211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230  
};
*/

uint8 const LineRealCountVal03[CameraHight] = 
{
15,18,21,24,27,30,33,36,39,42,45,48,51,54,57,60,63,66,69,72,75,78,81,84,87,90,
93,96,99,102,105,108,111,114,117,120,123,126,129,132,135,138,141,144,147,150,
153,156,159,162
};

uint8 const LineRealCountVal120_01[CameraHight] = 
{
10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,
58,60,62,64,66,68,70,72,74,76,78,80,82,84,86,88,90,92,94,96,98,100,102,104,106,108
};




//场中断服务函数,下降沿触发中断，暂定为PTD1
void FieldIsr(void)  
{
    if(ImgStatus == ImgGetStart)  //如果的确是在ImageGet()中置了开始位，则继续。
    {
      //进来前已经清过标志位
      enable_irq(LINE_IRQ);         //使能行中断IRQ
      enable_irq(DMA0_IRQ);         //使能DMA0的IRQ
      
      LineCount = 0;               //采集行数初始值为1，后面的溢出判断就用">"而不是">="
      LineRealCount = 0;
      //LineCount_Index = 0;

      DMA_BASE_PTR->TCD[0].DADDR = (uint32)ImgRaw[0];     //目的地址恢复为数组开头

      
      DMA_ERQ &= ~(1 << 0);      //DMA硬件禁用
    }
    else
    {
        uart_sendN(UART0, (uint8 *)"\nError In FieldIsr()!", 21);  //错误警报
    }
}



//行中断服务函数,上升沿触发中断，暂定为PTC8
void LineIsr(void)
{
    LineRealCount++;             //实际行计数
    if(LineRealCount == LineRealCountVal120_01[LineCount])  //如果是需要采集的行，就采集，不是的话就跳过
    {
       //LineCount_Index++;
        //DMA_INT |= (1<<0);        //清DMA传输完成标志位
        DMA_ERQ |= (1 << 0);      //DMA硬件使能
    }
}






//图像获取函数
void ImageGet(void)
{
    
    ImgStatus = ImgGetStart;        //图像采集标志位置为开始
    enable_irq(FIELD_IRQ);         //开启图像采集
    
    while(ImgStatus != ImgGetFinish) ; //如果图像采集未结束，则一直等待。
        
}






















