#ifndef __RunControl_H__
#define __RunControl_H__
/******************************************************************************/
/*******************************************************************************
  文件名：运动控制H件RunControl.h
  功  能：偏差求取，PID反馈，控制电机，控制舵机。
  日  期：2014.11.15
  作  者：HJZ & YCR
  备  注：
*******************************************************************************/
/******************************************************************************/
//1. 头文件
//2. 宏定义
//3. 变量类型定义
//4. 变量声明
//5. 函数声明

//1. 头文件
#include "common.h"
#include "gpio.h"
#include "Ftm.h"
#include "ImagePro.h"
#include "VirtualScope.h"


//5. 函数声明
extern void SportControl(uint8 ImageProFlag);


#endif // end of __RunControl_H__